; domain
(define (domain alpha-twist)
  (:predicates 
    (arm-at ?a ?p)
    (next-pos ?p1 ?p2)
  )
  (:action rotate
    :parameters (?old-pos ?new-pos ?arm)
    :precondition (and (arm-at ?arm ?old-pos)
                       (next-pos ?old-pos ?new-pos))
    :effect (and (arm-at ?arm ?new-pos)
                 (not (arm-at ?arm ?old-pos)))
  )
)

; problem
(define (problem twisting-g)
  (:domain alpha-twist)
  (:objects 
    f r b l
    arm0 arm1 arm2 arm3
  )
  (:init
    (next-pos f r) 
    (next-pos r b) 
    (next-pos b l) 
    (next-pos l f) 

    (arm-at arm0 f)
(arm-at arm1 f)
(arm-at arm2 f)
(arm-at arm3 b)
  )
  (:goal 
    (and 
        (arm-at arm0 f)
(arm-at arm1 l)
(arm-at arm2 l)
(arm-at arm3 f)
    )
  )
)

; plan
1. (rotate b l arm3)
   deleted: (arm-at arm3 b)
   added: (arm-at arm3 l)
   goals met: 1 of 4
2. (rotate l f arm3)
   deleted: (arm-at arm3 l)
   added: (arm-at arm3 f)
   goals met: 2 of 4
3. (rotate f r arm2)
   deleted: (arm-at arm2 f)
   added: (arm-at arm2 r)
   goals met: 2 of 4
4. (rotate r b arm2)
   deleted: (arm-at arm2 r)
   added: (arm-at arm2 b)
   goals met: 2 of 4
5. (rotate b l arm2)
   deleted: (arm-at arm2 b)
   added: (arm-at arm2 l)
   goals met: 3 of 4
6. (rotate f r arm1)
   deleted: (arm-at arm1 f)
   added: (arm-at arm1 r)
   goals met: 3 of 4
7. (rotate r b arm1)
   deleted: (arm-at arm1 r)
   added: (arm-at arm1 b)
   goals met: 3 of 4
8. (rotate b l arm1)
   deleted: (arm-at arm1 b)
   added: (arm-at arm1 l)
   goals met: 4 of 4
